Задание №6. Инвертированные индексы
Цель: Изучение механизмов поиска информации в текстовых коллекциях с помощью индексированных индексов.
Общая информация по работе:

Инвертированный индекс (inverted index) — структура данных, в которой для каждого слова коллекции документов в соответствующем списке перечислены все документы в коллекции, в которых оно встретилось. Инвертированный индекс используется для поиска по текстам.

Для того чтобы избежать последовательного просмотра текстов при выполнении каждого запроса, заранее составляется инвертированный индекс документов, который ставит в соответствие терминам те документы из коллекции, в которых они встречаются.

Процесс реализации задания состоит из следующих этапов:

Собираем документы, подлежащие индексации.

Размечаем текст, превращая каждый документ в список лексем (tokens).

Проводим предварительную лингвистическую обработку, создаем список нормализованных лексем, представляющих собой индексируемые термины.

Индексируем документы, в которых встречается термин, создавая инвертированный индекс, состоящий из словаря и словопозиций (идентификатор документа).

яблоко → txt1, txt3

апельсин → txt2

ананас→ txt1, txt2

и т. д.

Задание:

На основе 10 текстовых файлов сформировать инвертированные индексы по вышеприведенному алгоритму.

Отсортировать индексы по лексемам (терминам). 

Реализовать несколько запросов на поиск: а) по алгоритму «грубой силы» b) с использованием инвертированных индексов

Сравнить времена поиска.

Проанализируйте результаты работы.

Критерии оценки:

Полнота и правильность описания алгоритма (20%).

Полнота тестирования приложения (20%).

Эффективность организации структуры приложения (20%)

Защита лабораторной работы (40%).
